#  Пользователь вводит месяц в виде целого числа от 1 до 12.
#  Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
#  Напишите решения через list и через dict.

userMonth = int(input("Че за месяц >>>"))
# словарем
calendar = {
    "зима": [12, 1, 2],
    "весна": [3, 4, 5],
    "лето": [6, 7, 8],
    "осень": [9, 10, 11]
}

for i in calendar.items():
    if userMonth in i[1]: print(i[0])

# списком
calendarList = {"зима", "зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень"}
print(calendarList[userMonth - 1])
